[
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\tInnovative Construction Group, LLC, an off-site construction services company serving developers, general contractors, and professional builders, plans to  establish manufacturing operations in Siler City, ", ". The $39.8 million project is expected to create approximately 157 jobs in Chatham County over the next five years.", "\r\n\r\nThe project is being supported, in part, by a Job Development Investment Grant (JDIG) approved by the state’s Economic Investment Committee earlier today. The project’s plans are also subject to receiving local incentives approvals and finalizing real estate negotiations. Over the 12-year term of this JDIG, the project is estimated to grow the state’s economy by $463.2 million.", "\r\n\r\n\"North Carolina’s growth and reputation as an excellent place to do business continues to attract great companies to the state,” said North Carolina Governor Roy Cooper. “Our manufacturing workforce, combined with the world-class training programs that support those workers, help companies succeed in North Carolina.”", "\r\n\r\nUsing a formula that considers the new tax revenues generated by the new jobs, the JDIG agreement authorizes the potential reimbursement to the company of up to $873,750, spread over 12 years. State payments only occur following performance verification by the Departments of Commerce and Revenue that the company has met its incremental job creation and investment targets.", "\r\n\r\nThe project’s projected return on investment of public dollars is 92 percent, meaning for every dollar of potential cost to the state, the state receives $1.92 in state revenue. JDIG projects result in positive net tax revenue to the state treasury, even after considering the grant’s reimbursement payments to a given company.", "\r\n\r\nBecause ICG chose a site in Chatham County, classified by the state’s economic tier system as Tier 3, the company’s JDIG agreement also calls for moving $291,250 into the state’s Industrial Development Fund – Utility Account. The Utility Account helps rural communities finance necessary infrastructure upgrades to attract future business. Even when new jobs are created in a Tier 3 county such as Chatham, the new tax revenue generated through JDIG grants helps more economically challenged communities elsewhere in the state.", "\r\n\r\n“Innovative Construction Group joins North Carolina’s business community at a time of strong growth and opportunity,” noted Commerce Secretary Machelle Baker Sanders. “Just as this company is investing in our state, we must continue to invest in the public education and workforce training systems that are the building blocks of economic growth in North Carolina.”\r\n\r\nInnovative Construction Group (ICG) serves building professionals focused on single-family, multi-family, and commercial construction projects. The company provides design services, manufactures wall panels, roof trusses and floor systems, and offers on-site installation to provide a full frame shell construction process.", "\r\n\r\nPartnering with the North Carolina Department of Commerce and the Economic Development Partnership of North Carolina (", ") on this project were the North Carolina General Assembly, the North Carolina Community College System, the North Carolina Department of Transportation, the North Carolina Railroad Company, Commerce’s Division of Workforce Solutions, Duke Energy, Norfolk Southern, Chatham County, the Town of Siler City, and the Chatham Economic Development Corporation.", "\r\n \r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\tNational window manufacturer Crystal Window and Door Systems plans to establish operations in Mansfield, ", ". The more than $121 million project is expected to create 504 jobs.", "\r\n\r\nThe company will construct a new advanced manufacturing facility and regional corporate headquarters on 44 acres north of Heritage Parkway and west of 287.", "\r\n\r\n “I started this company in 1990 with a small commercial operation in New York City, and with focus, determination, and a lot of hard work with dedicated employees, Crystal is now a national manufacturer with five major production facilities across the country,” said Crystal Chairman and Founder Thomas Chen. “Our products are used in some of the most notable buildings throughout the nation, and I am thrilled to bring our expertise to the great state of Texas.”", "\r\n \r\nThe project is being supported by a Texas Enterprise Fund (TEF) grant of $3,150,000. In addition, the company received a $15,000 Veteran Created Job Bonus.", "\r\n \r\n“'Made in Texas' is a powerful global brand, and I congratulate Crystal Window and Door Systems on this significant investment in our great state,” noted Governor Gregg Abbott. “When choosing where to locate or expand their businesses, more and more innovative industry leaders choose Texas. This new advanced manufacturing facility and regional headquarters will bring hundreds of good-paying jobs for hardworking Texans in Mansfield and millions in capital investment to the Dallas-Fort Worth area. I look forward to celebrating continued success for Crystal Window and Door Systems as we work together to build a bigger, better Texas for decades to come.\"", "\r\n \r\nCrystal Window and Door Systems manufactures energy-efficient vinyl and aluminum windows and high-end fenestration systems. The company currently operates production facilities in New York City, Pennsylvania, Illinois, California, and Missouri. ", "\r\n \r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\tSoy sauce manufacturer Kikkoman Foods Inc. plans to expand its brewing plant in Walworth and establish operations in Jefferson, ", ". The $800 million project is expected to create 83 jobs over twelve years.", "\r\nThe new 240,000 square-foot Jefferson facility will produce soy sauce and soy sauce–related seasonings, including teriyaki sauce. Operations are scheduled for Fall 2026.", "\r\n\r\n“We have always valued Walworth for its great market access, outstanding workforce, central location for raw materials, pure water, and the open-hearted spirit of partnership of the local community,” said Mr. Yuzaburo Mogi, honorary chief executive officer and chairman of the board of Kikkoman Corp. “We chose Jefferson for those same reasons, and we look forward to expanding our footprint in Wisconsin and establishing a supply chain with increased stability in North America, Kikkoman’s largest overseas market.”", "\r\nTo support the project Wisconsin Economic Development Corporation (", ") approved awarding up to $15.5 million in performance-based tax credits to assist the company with its expansion.", "\r\n\r\n “Fifty years ago, Kikkoman made history by choosing Walworth, Wisconsin, for its first international brewing plant,” noted Wisconsin Economic Development Corporation Secretary and CEO Missy Hughes. “Now Kikkoman is opening a new chapter in that history by expanding its presence in Walworth and Jefferson.”", "\r\nKikkoman Corporation is a Japanese food manufacturer offering soy sauce, food seasoning and flavoring, mirin, shochu, and sake, juice and other beverages, pharmaceuticals, and restaurant management services. The company has production plants and offices in Japan, the U.S., the Netherlands, Singapore, China, Taiwan, and Canada.", "\r\n“Kikkoman’s decision to choose Jefferson for their expansion speaks volumes about the strategic advantages and opportunities we offer,” added Deb Reinbold, president of Thrive Economic Development. “We’re excited to work with Kikkoman to ensure their success in our community and to maximize the positive impact of this investment.”", "\r\n\r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\tGreenheck Group, a supplier of air movement, air control and air conditioning equipment, plans to establish operations in Knoxville, ", ". The $300 million project is expected to create 440 jobs in Knox County.", "\r\n \r\nThe new corporate campus will include manufacturing and warehousing facilities as well as a main office and dedicated space for training and research and development.", "\r\n \r\n“Knoxville’s innovative spirit aligns with the values our founders, the Greenheck brothers, established more than 75 years ago. Our investment in this new campus supports our unwavering commitment to our customers, our team members and the communities in which we are blessed to be part of. We couldn’t be more excited to become part of the vibrant Knoxville community, which provides not only strategic proximity to our customers, but also talented people, outstanding community partners and a welcoming culture,”  Greenheck Group CEO Rich Totzke said.", "\r\n  \r\nGreenheck Group specializes in manufacturing industrial ventilation equipment, found in schools, malls, office spaces and industrial plants.", "\r\n \r\n“At TNECD, we believe that the relationships built here are the differentiating factor that sets Tennessee apart from other states in the recruitment process. In the last year, we have had the opportunity to get to know Greenheck Group, a wonderful, 77-year-old family-owned business, which shares our values and has a company culture that will be the perfect addition to the Knoxville community. As one of the largest manufacturing projects to locate in Knox County in the last decade, we are excited to see the impact this company will have regionally for years to come,” ", " Commissioner Stuart C. McWhorter noted.", "\r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\tBWX Technologies, Inc. plans to expand its nuclear manufacturing operation in Cambridge, Ontario, ", ". The $80 million project is expected to create 250 jobs.", "\r\n\r\n\r\nThe investment will enable greater capacity to support ongoing and anticipated customers’ investments in Small Modular Reactors, traditional large-scale nuclear and advanced reactors, in Canada and globally, according to company officials. Production is scheduled for the middle of 2026.", "\r\n \r\n“Our expansion comes at a time when we’re supporting our customers in the successful execution of some of the largest clean nuclear energy projects in the world,” said John MacQuarrie, president of Commercial Operations. “At the same time, the global nuclear industry is increasingly being called upon to mitigate the impacts of climate change and increase energy security and independence. By investing significantly in our Cambridge manufacturing facility, BWXT is further positioning our business to serve our customers to produce more safe, clean and reliable electricity in Canada and abroad.” ", "\r\n\r\nBWXT is a manufacturing and engineering innovator that provides safe and effective nuclear solutions for global security, clean energy, environmental restoration, nuclear medicine and space exploration. The company has 14 major operating sites in the U.S., Canada and the U.K. In addition, BWXT joint ventures provide management and operations at a dozen U.S. Department of Energy and NASA facilities.", "\r\n \r\n“We’re thrilled to see BWXT expand its footprint and create hundreds of new jobs in Cambridge. As our province continues to lead the future of nuclear energy, the company’s investment will help provide Ontario families and businesses with access to clean, reliable and affordable electricity for generations to come,” noted Premier of Ontario Doug Ford.", "\r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\t Local Bounti Corporation, an indoor agriculture company, plans to establish operations in Pasco, ", ". The project is expected to create 40 jobs.", "\r\n\r\nThe new controlled environment agriculture facility, located on three acres, will directly service local retail distribution centers within the Pacific Northwest region and provide additional capacity to meet existing demand from the company's direct relationships with blue-chip retail customers.", "\r\n \r\n \"We are proud to officially be able to call Pasco home with the opening of this latest facility, which enhances our rapidly growing distribution footprint across the US,” said Craig Hurlbert, Local Bounti's CEO. “Our state-of-the-art CEA facility, which is underpinned by our innovative and patented Stack & Flow Technology, enables us to support existing customer demand in Washington, Oregon, and adjacent markets in the Pacific Northwest. We are excited about the opportunities this facility creates, not only for our Company but also for the local economy and the environment. Our pledge to sustainability and community engagement remains unwavering, and we look forward to contributing positively to Pasco and the broader Pacific Northwest region.”", "\r\n\r\nLocal Bounti's patented Stack & Flow Technology combined the advantages of vertical and greenhouse cultivation. The company grows fresh, non-GMO greens 365 days a year in our greenhouses, using 90% less water and 90% less land than conventional agriculture. Local Bounti currently operates advanced indoor growing facilities across the U.S., servicing approximately 13,000 retail doors.", "\r\n \r\n \"Pasco extends a warm welcome to Local Bounti in our community and the Tri-Cities region. Their dedication to integrating into the community, creating jobs, and prioritizing sustainable practices represents a substantial investment in Pasco's future,\" noted Jacob Gonzalez, Director Community & Economic Development for the City of Pasco. \"We are eager to collaborate with Local Bounti as they contribute to our city's growth and diversity of economic opportunities.\"", "\r\n \r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\tDenmark-based Topsoe, a manufacturer of solid oxide electrolyzer cells, a crucial component for producing clean hydrogen, plans to establish operations in Chesterfield County, ", ". The more than $400 million project is expected to create approximately 150 jobs.", "\r\n\r\nThe investment will include the construction of a new manufacturing facility.", "\r\n \r\n“We are thrilled to announce our plans for a new state-of the art US facility that will manufacture Solid Oxide Electrolyzer Cell stacks (SOEC), the key element to the world’s most efficient electrolyzer technology for producing clean hydrogen,” said Roeland Baan, CEO of Topsoe. “Through legislation like the Inflation Reduction Act and strong support from individual states such as Virginia, the US government is helping to accelerate the ", ". With our strong dedication to innovation, we will help the US achieve its goals of driving down the cost of clean hydrogen and delivering clean energy jobs.”", "\r\n\r\nThe project is being supported by $136 million in tax credits from the Inflation Reduction Act. Topsoe received a tax credit through the DOE’s Advanced Energy Project Credit (48C) program, which was expanded as part of the IRA. The 48C tax credit covers 30 percent of the amount invested in new or upgraded facilities that build renewable energy components. The IRA included a set-aside in the 48C program for coal communities, which Chesterfield qualified for due to the retirement of a nearby coal-fired electric generating unit.", "\r\n\r\n “I am thrilled that Topsoe has chosen the great commonwealth of Virginia for its new, state-of-the-art factory that will be key to scaling clean hydrogen production,” noted Governor Glenn Youngkin. “Virginia’s robust workforce, strategic location and top business climate provide the necessary tools for Topsoe to continue to grow as a leader in the clean energy industry.”", "\r\n\r\n“Chesterfield is pleased to be the location for Topsoe’s largest U.S. investment on record,” added Matt McLaren, deputy director of business attraction for Chesterfield Economic Development. “This announcement builds upon previous investments from leading international firms, and we look forward to announcing more details of this project in the coming weeks.”", "\r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\tJDSAT, Inc., an application development and data sciences firm, plans to expand its operations in Fairfax County, ", ". The $630,000 project is expected to create 60 jobs.", "\r\n \r\nThe investment will include technical staff and analysts to support the company’s growing artificial intelligence, cloud computing, and data science business. ", "\r\n \r\n“This new ", " opening signifies an exciting step in JDSAT’s growth, allowing us to expand both our teams and capabilities,” said Scott Woosley, CEO at JDSAT, Inc. “As part of our commitment to provide a collaborative work environment for our talented staff, this new space offers the resources and amenities to thrive, fostering a sense of unity and inclusion. We’re thrilled to embark on this next chapter in such a vibrant community that aligns well with our company culture and are so thankful to the Commonwealth of Virginia and Fairfax County for their support.” ", "\r\n\r\nThe Virginia Economic Development Partnership (", ") worked with Fairfax County to secure the project and will support JDSAT’s job creation through the Virginia Jobs Investment Program (VJIP), which provides consultative services and funding to companies creating new jobs in order to support employee recruitment and training activities. As a ", " supporting economic development, VJIP reduces the human resource costs of new and expanding companies. VJIP is state-funded, demonstrating Virginia’s commitment to enhancing job opportunities for citizens.", "\r\n \r\n“JDSAT’s decision to expand its operations in Fairfax County shows that Virginia is a strong, reliable business partner,” noted Secretary of Commerce and Trade Caren Merrick. “The Commonwealth is a top state for tech talent that offers the location, infrastructure, and robust workforce that attract companies like JDSAT, and I congratulate all the partners involved on this expansion.”", "\r\n \r\nJDSAT, Inc. provides a broad range of technology development, data analysis, and research-driven consulting services for commercial entities and government agencies. ", "\r\n\r\n“Congratulations to JDSAT for growing in Fairfax County,” added Victor Hoskins, president and CEO of Fairfax County Economic Development Authority (FCEDA). “We thank you for your continued investment and your deep involvement within our community. It is our honor to support your success and celebrate your impact here in Fairfax County.”", "\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\tTruss manufacturer Trussworks Mid-America plans to establish production operations in Jackson, ", ". The $5 million project is expected to create 70 jobs.", "\r\n\r\nThe new facility will be located in a Cape Girardeau County Enhanced Enterprise Zone, which provides a 50 percent real property tax abatement for ten years. Operations are scheduled to begin later this year.", "\r\n\r\n“We are excited to embark on this expansion journey and to establish our new facility in Jackson,” said Steve Stroder, President and CEO of Trussworks Mid-America, LLC. “With the support of the Missouri Department of Economic Development, local authorities, and our dedicated team, we are confident in our ability to drive success and contribute positively to the local economy. This investment underscores our commitment to delivering exceptional products to our customers while creating jobs and opportunities for the community.”", "\r\n\r\nTrussworks will also benefit from the Missouri Works program, a tool that helps companies expand and retain workers by providing access to capital through withholdings or tax credits for job creation.", "\r\n \r\n“DED is proud to support Trussworks as it establishes in Jackson and creates new opportunities for Missourians to prosper,” noted Michelle Hataway, Acting Director of the Department of Economic Development. “We appreciate the collaborative efforts of our partners who helped ensure this company brings new investment and job creation to southeast Missouri.”", "\r\n \r\nIn addition, the investment is being supported by a $787,812 grant from the Community Development Block Grant (CDBG) program to construct and improve public infrastructure, including streets, water distribution, stormwater, and sanitary sewer, to make the project possible.", "\r\n \r\n“We are encouraged to see this significant investment and job creation by Trussworks in southeast Missouri,” added Shad Burner, Management Consultant for SEMO REDI. “This expansion will not only bolster Jackson’s local economy but also reaffirm our attractiveness for business growth and development. This project perfectly highlights the collaborative efforts among business leaders, government officials, and SEMO REDI to drive sustained prosperity in our region.”", "\r\n\r\nTrussworks designs and builds wood trusses for individuals, general contractors, and builders. In addition to standard wood floor trusses and wood roof trusses, the company also supplies timber trusses, timber products (posts and beams), engineered wood products (posts and beams), Simpson Construction hardware, and wall panels. ", "\r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\tIntegrated forest products company Canfor Corp. plans to expand production operations in Fulton, ", ". The $19.3 million project is expected to create 64 jobs in Clarke County.", "\r\n\r\nThe investment will include a second production shift at the company’s existing facility as it closes its mill in Jackson.", "\r\n \r\n“Canfor’s recent investments in Southern Alabama demonstrate our commitment to Clarke County and build upon a proud history of operations in the region, said Lee Goodloe, president of Canfor Southern Pine. “We appreciate our employees, and our strong relationships with suppliers, contractors, partners, and customers. Consolidating our operations in Southern Alabama in modernized facilities — with leading technologies and innovation — will enable Canfor to better serve our local and global customers while providing more sustainable jobs and improved working conditions for our employees.”", "\r\n \r\nTo support the project the Clarke County Commission, along with the Town of Fulton, approved a 10-year tax abatement on the new installation of the #3 continuous dry kiln, fire protection upgrades, blower system upgrade and planer mill/kiln access road..", " \r\n“Canfor’s strategic optimization plan reinforces the company’s commitment to Alabama, and its production expansion in Fulton will provide a long-term benefit to rural Clarke County in the form of a competitive and modernized facility,” noted Brenda Tuck, Rural Development Manager for the ", ".", "\r\n\r\nIn addition, the Town of Fulton is receiving $400,000 in grants to upgrade the town’s sewer capacity, due to the growth. The funding is split between ADECA’s Community Development Block Grant (CDBG) and Delta Regional Authority Funds, administered through the Alabama Tombigbee Regional Planning Commission.", "\r\n\r\n“We are excited to see Canfor grow in our region and look forward to many years of success and growth with them and other wood products companies here in the heart of the wood basket,” added Rosalyn Sales, executive director of Economic Development for Clarke and Washington counties.", "\r\n\r\nCanfor manufactures high-quality dimension lumber, value-added finishing products, and top-quality pulp & paper. The company also produces wood pellets and green energy. ", "\r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\tEpic Flight Academy established its new FAA Part 147 aircraft mechanic school at Cincinnati/Northern Kentucky International Airport (CVG) in Hebron, ", ".", ".", "\r\n \r\nThe approximately 32,000-square-foot facility consists of more than 15,000 square feet of shop space/training area and nearly 16,000 square feet of classrooms and finished office space.", ".", "\r\n\r\n“Workforce development is the most important and proactive step we can take for the future of Kentucky’s economy,” said Governor Andy Beshear. “This new training facility from Epic Flight Academy will train workers at CVG, helping prepare thousands of Kentuckians to make an impact in their communities, while also supporting their families through skilled, well-paying jobs. We’re committed to building a pipeline for a skilled workforce, and this is the latest example of that commitment.”", ".", "\r\n\r\nEpic Flight Academy offers students the opportunity to become an FAA-certified airframe and powerplant (A&P) aviation mechanic in the aerospace industry. Epic Flight Academy Aircraft Mechanic Program welcomed its first class of students in 2020, and students began training at CVG on April 15, 2024. The program takes approximately 18 months.", ".", "\r\n\r\n“The demand for aircraft maintenance technicians is ever-growing, and Epic Flight Academy has begun filling that need with their first class starting last week,” noted Lee Crume, President and CEO of ", ". “The new jobs being created by CVG’s cargo and passenger growth offer tremendous opportunities in the Cincinnati region.”", ".", "\r\n \r\n“We are pleased to welcome Epic Flight Academy to CVG, and we look forward to growing this partnership. Aircraft mechanics are in high demand,” added CVG CEO Candace McGraw. “Epic Flight Academy will open doors for students across our region who represent the future of the aviation industry and will provide a well-trained pipeline for employment at CVG.”", ".", "\r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\tDaisy Brand, a manufacturer and largest brand of sour cream and cottage cheese in the U.S., plans to establish operations in Boone, ", ".  The $626.5 million project is expected to create 106 jobs.", "\r\n\r\nThe new 750,000-square-foot manufacturing facility will allow the company to meet increased consumer demand.", "\r\n\r\n“At its core, economic development is about partnerships between communities, companies and the state to ensure future growth,” said Debi Durham, director of the Iowa Economic Development Authority and Iowa Finance Authority. “This significant investment is a testament to those partnerships, one that will pay off for Boone and Iowa.” ", "\r\n\r\nTo support the project the Iowa Economic Development Authority (IEDA) board approved $7 million in direct financial assistance as well as tax benefits.", "\r\n\r\n“This truly was a regional effort to attract a national brand to central Iowa,” noted Dan Culhane, President & CEO of the Ames Chamber of Commerce and Economic Development Commission. “Our community partners in Boone worked tirelessly to make this project a reality for not only the benefit of Boone, but our entire region.”", "\r\n\r\nDaisy Brand currently operates manufacturing facilities in Garland, Texas, Casa Grande, Arizona, and Wooster, Ohio. ", "\r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\tEPC-Columbia Inc., a plastic injection molding company, plans to expand operations in Lebanon, ", ". The $3.6 million project is expected to create 21 jobs in Marion County.", "\r\n\r\nThe investment will include an additional 40,000 square feet at the company’s existing facility, allowing for increased manufacturing operations, office space and equipment.", "\r\n \r\n“We are extremely excited to be expanding our operations and continue working within the Marion County community,” said Reza Kargarzadeh, president of EPC-Columbia. “I want to thank everyone who made this project possible, including the hard-working, dedicated employees of EPC-Columbia, local officials and the Kentucky Cabinet for Economic Development. We are thrilled to enter this next chapter as a company and look forward to continuing to provide quality products and services to our customers around the world.”", "\r\n\r\nThe Kentucky Economic Development Finance Authority (KEDFA) preliminarily approved a 15-year incentive agreement with the company under the Kentucky Business Investment program. The performance-based agreement can provide up to $350,000 in ", " based on the company’s investment of at least $1 million and annual targets of: creation and maintenance of 21 Kentucky-resident, full-time jobs across 15 years, and paying an average hourly wage of $20.42, including benefits across those jobs.", "\r\n \r\nBy meeting its annual targets over the agreement term, the company can be eligible to keep a portion of the new tax revenue it generates. The company may claim eligible incentives against its income tax liability and/or wage assessments.", "\r\n\r\n“The manufacturing sector is a staple of Kentucky’s booming economy,” noted Governor Andy Beshear. “Having companies already established here in the commonwealth choosing to expand and grow their operations is a critical component of the state’s continued economic success. EPC-Columbia is providing quality job opportunities for Marion County and the surrounding community, and I congratulate the company on this exciting next step.”", "\r\n \r\nIn addition, EPC-Columbia can receive resources from Kentucky’s workforce service providers. Those include no-cost recruitment and job placement services, reduced-cost customized training and job-training incentives.", "\r\n\r\n“We welcome this exciting news for our community as EPC expands its operations, bringing new opportunities and economic growth to our community,” added Brooklyn Leep, Marion County economic development director. “We appreciate their continued investment and commitment to Marion County.”", "\r\n \r\nEPC’s services include injection molding, two-shot injection molding, vacuum forming, cast skin, urethane foaming and painting. Industries served include automotive, commercial and consumer appliance, aerospace, off-road heavy equipment, agriculture and forestry, scientific and medical sectors. EPC currently operates in Alabama, Florida, Iowa, Indiana, Kentucky, Missouri, Wisconsin, Michigan, Ohio, South Carolina, Canada and Mexico.", "\r\n\r\n\r\n"]},
{"text": []},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\tTucker Door & Trim, a distributor and manufacturer of doors, windows, and specialty millwork to the construction industry, plans to establish manufacturing and assembly operations in Henrico County, ", ". The $10 million project is expected to create 50 jobs.", "\r\n\r\nThe new facility will be dedicated to fiberboard and fiberglass doors and windows and will provide the company the ability to serve the northeastern market. ", "\r\n \r\n“Our mission to become the premier choice for windows and doors and our growth plans made Virginia an ideal location for us,” said Phil Odom, President of Tucker Door & Trim. “This new location will offer us an unrivaled opportunity to serve new customers, grow and develop our team, and actively participate in our communities. We plan to bring the Tucker Door & Trim brand of service, product selection, and quality to Virginia with the same principles we have operated on for over 50 years.” ", "\r\n\r\n The Virginia Economic Development Partnership (", ") worked with the Henrico Economic Development Authority and the Greater Richmond Partnership (", ") to secure the project.", "\r\n \r\n “Virginia offers a world-class location for manufacturing and the wood products industry, and we celebrate Tucker Door & Trim’s decision to establish its new operation in Henrico County,” noted  Secretary of Commerce and Trade Caren Merrick. “Virginia’s manufacturing industry continues to grow and thrive, and the Commonwealth offers the business climate, natural resources, and proximity to markets that will build long-term success for companies like Tucker Door & Trim.”", "\r\n \r\nTucker Door & Trim offers a fleet of tractor-trailers making regular deliveries to wholesale customers throughout the southeastern U.S., including Alabama, Florida, Georgia, North Carolina, and South Carolina, Tennessee, and Virginia.", "\r\n\r\n “Greater Richmond’s strategic location to 45 percent of the US population within one day’s delivery drive proves enticing to a myriad of expanding firms. We’re excited to welcome Tucker Door & Trim to the region’s manufacturing industry that supports homebuilding,” added Jennifer Wakefield, President & CEO, Greater Richmond Partnership.", "\r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\tZekelman Industries, an independent steel pipe and tube manufacturer, plans to expand operations in Blytheville, ", ".", "\r\n \r\nThe $120 million investment at the company’s subsidiary, Atlas Tube, will allow it to manufacture inline steel tube galvanizing products in size ranges not currently available in North America.", "\r\n\r\n“Education and skills training are crucial to developing the next generation of workers. Our goal at Zekelman is to prepare, nurture and inspire students entering the thriving and well-paying steel industry,” said Tom Muth, Zekelman Industries chief operating officer. “Our commitment is representative of our partnership with the Blytheville community and ongoing dedication to domestic-only manufacturing. We are particularly grateful to Mayor Logan and Mississippi County for their continued support.”", "\r\n\r\nZekelman is a family of operating companies that includes Atlas Tube, Picoma, Sharon Tube, Wheatland Tube, Western Tube and Z Modular. The company is a manufacturer of hollow structural sections (HSS) and steel pipe and a producer of electrical conduit and elbows, couplings and nipples. Zekelmancurrently operates 20 manufacturing locations in North America.", "\r\n \r\n“Zekelman Industries is a major steel producer and a valued member of Arkansas’ business community. We are proud that Zekelman has chosen to expand in Blytheville,” noted Clint O’Neal, executive director of the Arkansas Economic Development Commission. “Mississippi County is the leading steel-producing county in the nation – this is made possible by great companies and visionary local leaders.”", "\r\n \r\n“Mississippi County’s business climate makes it a prime location for companies like Zekeman to establish and expand their operations,” added Clif Chitwood, president of the Great River Economic Development Foundation. “Our trained workforce, supported by institutions like Arkansas Northeastern College, is one of the many factors that sets us apart and allows manufacturers to flourish here.”", "\r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\tIndustrial manufacturer Fibrebond Corporation plans to expand operations in Webster Parish, ", ". The $50 million project is expected to retain 450 jobs.", "\r\n\r\nThe investment will include the construction of a new 297,000-square-foot manufacturing facility that will accommodate the wiring and installation of electrical gear in the concrete and steel modular buildings the company produces. Production is scheduled for September 2025.", "\r\n\r\n \r\n“The pace of our growth has increased since we began expanding our Minden campus in May 2022, driven broadly by the digitization and electrification trends,” said Fibrebond President and CEO Graham Walker. “The expansion in Louisiana makes the most sense for our business. We have added 180 direct and 100 subcontractor jobs in the past 15 months, and all of those people are building for projects across the country. Our ability to automate and scale with quality is only possible because of the employees we have in north Louisiana.”", "\r\n\r\n \r\nThe project is being supported by an incentive package featuring a performance-based Retention and Modernization Tax Credit valued at nearly $1.7 million over five years, contingent on investment, job retention and payroll targets being met.", "\r\n\r\n \r\n “On behalf of the State of Louisiana I want to thank Fibrebond Corporation for investing more than $100 million in Webster Parish over the past three years, providing quality jobs for the Northwest Region’s skilled workforce,” noted Louisiana Economic Development (", ") Secretary Susan B. Bourgeois. “This project is especially exciting because it capitalizes on Louisiana’s existing manufacturing strength to create new opportunities in emerging markets such as data center and telecommunications infrastructure. That is a winning formula for Louisiana.”", "\r\n\r\n\r\nFibrebond specializes in the manufacturing of concrete and steel structures for use in large-scale utility, power and data center projects.", "\r\n\r\n \r\n“Fibrebond’s continued investment into Northwest Louisiana and Minden is certainly a sign of the company’s ability to succeed in this region,” North Louisiana Economic Partnership President and CEO Justyn Dixon added. “We celebrate the continued success of companies like Fibrebond, knowing that their achievements contribute significantly to the overall vitality of this region.”", "\r\n\r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\tL3Harris Technologies, an American technology company, defense contractor, and information technology services provider, plans to expand manufacturing operations in Orange County, ", ". The $41.2 million project is expected to create 80 jobs over the next three years.", "\r\n\r\nThe investment will include the construction of new facilities and the addition of equipment and tools to increase solid rocket motor production at its Aerojet Rocketdyne site.", "\r\n\r\n“This agreement builds upon L3Harris and U.S. government investments in our solid rocket motor production capabilities for critical defense systems,” said Ross Niebergall, President, Aerojet Rocketdyne, L3Harris. “We have been a part of the Virginia community for decades and look forward to growing our talented workforce here as we produce the vital propulsion that helps protect our nation and its allies.”  ", "\r\n \r\nThe project is being supported by a $540,000 grant from the Commonwealth’s Opportunity Fund. Funding and services to support the company’s employee training activities will be provided through the Virginia Jobs Investment Program. ", "\r\n \r\n“Virginia’s aerospace sector propels growth, innovation, and economic opportunity, thanks to global industry leaders like L3Harris,” noted Secretary of Commerce and Trade Caren Merrick. “The company has a long history of success in Orange County, and we are excited to strengthen our partnership and support the company’s expansion and additional job creation in Central Virginia.”", "\r\n\r\nThe Virginia Economic Development Partnership (", ") worked with Orange County and the Central Virginia Partnership for Economic Development to secure the project. ", "\r\n\r\n\r\n “A very important company in our aerospace and defense sector, L3Harris is exactly the type of company we want to have remain and grow in Central Virginia,” added Helen Cauthen, President, Central Virginia Partnership for Economic Development. “We are delighted to celebrate their successes in Orange County.” ", "\r\n \r\nL3Harris Technologies, Inc. produces command and control systems and products, wireless equipment, tactical radios, avionics and electronic systems, night vision equipment, and both terrestrial and spaceborne antennas for use in the government, defense, and commercial sectors. The company specializes in surveillance solutions, microwave weaponry, and electronic warfare.", "\r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\tRepublic Airways Holdings and its Leadership in Flight Training (LIFT) Academy plan to establish operations in Tuskegee, ", ". The $27 million project is expected to create 35 jobs over the next three years.", "\r\n\r\nThe new training center will be located at Moton Field where students in the LIFT program will train on the academy’s signature fleet of Diamond DA40-NG single-engine and Diamond DA42-VI twin-engine aircraft, as well as technologically advanced flight simulators.", "\r\n\r\n“We are excited to grow our aviation community in Alabama. This expansion is possible due to Governor Ivey’s strong leadership in workforce development, which is bringing significant opportunities for aviation education and training and creating new jobs throughout the state,” said Matt Koscal, Executive Vice President and Chief Administrative Officer, Republic Airways Holdings Inc. “By joining forces with Tuskegee University and its esteemed heritage, we are honored to enable opportunity and shape the next generation of commercial pilots.”", "\r\n\r\nRepublic Airways Holdings — which operates North America’s second largest regional airline, Republic Airways — formed LIFT Academy as an internal flight school in 2018.  The program targets students from traditional and non-traditional backgrounds, training them in a commercial flight school. LIFT graduates can transition to first officer at Republic Airways with a pathway to the captain’s seat.", "\r\n\r\n“The LIFT Academy project at Moton Field will have massive impacts on Macon County not only through the creation of jobs at the airfield but also the high-paying careers that will stem from the flight training,” noted Ellen McNair, Secretary of the ", ". “We’re looking forward to supporting this initiative because it will be a real game changer for the community and its citizens, as well as Tuskegee University and its students.”", "\r\n \r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\tSamsung Electronics, Co., Ltd., a leader in the global semiconductor industry, plans to expand its operation in Taylor, ", ". The more than $40 billion project is expected to create approximately 4,500 jobs over the coming years.", "\r\n \r\nThe investment will include a new chip manufacturing facility scheduled for production in 2026. In addition, the company will construct a research and development center scheduled for operations in 2027.", "\r\n\r\n“We’re not just expanding production facilities; we’re strengthening the local semiconductor ecosystem and positioning the U.S. as a global semiconductor manufacturing destination.” said Samsung Semiconductor CEO Kye Hyun Kyung. “To meet the expected surge in demand from U.S. customers, for future products like AI chips, our fabs will be equipped for cutting-edge process technologies and help bring security to the U.S. semiconductor supply chain.”", "\r\n\r\nThe project is being supported by $6.4 billion in direct funding under the CHIPS and Science Act.", "\r\n\r\n “Just over two years ago here at the Governor's Mansion, I was proud to celebrate Samsung’s new semiconductor manufacturing facility in Taylor,” noted Governor Greg Abbott. “We are now building on that initial investment to make Texas the premier semiconductor hub in America. Samsung's investment of over $40 billion will help cement Texas’ position as the No. 1 state for semiconductors, bringing in more business investment to Texas communities and creating thousands of good-paying jobs in our great state. The future is full of microchips, and we’re proud that some of the world’s most advanced chips will be Made in Texas.”", "\r\n\r\nIn 2021, Samsung announced that it would build a $17 billion semiconductor manufacturing facility in Taylor.", "\r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\t Master Steel, a structural steel fabrication company, plans to expand its operations in Hardeeville, ", ". The $10 million project is expected to create 14 jobs.", "\r\n \r\nThe investment includes a new fabrication shop, a 10-ton outside girder crane and new robotic machinery at the company’s facility located at 9769 Speedway Blvd. ", "\r\n\r\n “We named our business Master Steel because we work for our Master, the Lord Jesus Christ. He has been good to us through these many years in good times and bad. He has never left us. We are where we are today because of His blessings, not because we are good, but because He is good. He has given us good employees, good opportunities and clients. Our goal is to bring Him glory by enriching the lives of the families involved in our business in Jasper County and the surrounding areas,” Master Steel President and CEO Priscilla Stephens said.", "\r\n \r\nAs an ", " the Coordinating Council for Economic Development awarded a $50,000 Set-Aside grant to Jasper County to assist with the costs of real property improvements.", "\r\n \r\n“We congratulate Master Steel on its success in South Carolina and the additional jobs this project will create in Jasper County. The company’s continued investment in one of our state’s rural communities is reason to celebrate,” Secretary of Commerce Harry M. Lightsey III noted.", "\r\n\r\nMaster Steel, LLC is a structural steel fabrication and erection company that specializes in turn-key projects. ", "\r\n \r\n“Congratulations to Master Steel and Jasper County on the expansion! Master Steel is a vital member of our industrial community, and we are pleased to share their success story as their company continues to flourish in the SouthernCarolina Alliance region. SCA looks forward to working with Master Steel in the coming years as the company continues to grow,\" SouthernCarolina Alliance President and CEO Danny Black added.", "\r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\tSouth Africa-Based Radél, Inc., a manufacturer of electro-mechanical components, plans to establish operations in Winston-Salem, ", ". The $9 million project is expected to create 50 jobs in Forsyth County by 2029.", "\r\n \r\nThe new production facility will focus on power electronic assemblies, which are tailor-made for electric motor generator units that are critical to the heavy-vehicle sector, as well as advanced regulators and converters designed for the high demands of the defense industry.", "\r\n \r\n“We are thrilled to establish Radél's presence in North Carolina, reflecting our commitment to growth and innovation in the United States,” said Francois Rademeyer, CEO of Radél. “The tremendous support from the ", " and the warm hospitality of the local community have been instrumental in our decision. We look forward to expanding our operations, bringing cutting-edge technological advancements to the region, and contributing to the economic vitality of North Carolina.”", "\r\n\r\nThe project is being supported by a performance-based grant of $75,000 from the One North Carolina Fund. The OneNC Fund provides financial assistance to local governments to help attract economic investment and to create jobs. Companies receive no money upfront and must meet job creation and capital investment targets to qualify for payment. All OneNC grants require a matching grant from local governments and any award is contingent upon that condition being met.", "\r\n\r\n“North Carolina attracts companies and investment from all around the world,” noted North Carolina Commerce Secretary Machelle Baker Sanders. “We’re enjoying this international momentum because companies like Radél recognize and appreciate both our existing workforce and just as importantly, the state’s commitment to invest in the educational and training systems that keep North Carolina’s talent pipeline strong.”", "\r\n\r\nIn addition, Forsyth County Commissioners approved an ", " worth up to $69,746 over five years. City Council approved a package worth $68,000. ", "\r\n \r\n“We are excited to continue the momentum of our advanced manufacturing sector growth and continue proving that we are an ideal East Coast landing spot for companies from all around the world,” added Mark Owens, President and CEO of Greater Winston-Salem, Inc. ", "\r\n \r\nPartnering with the North Carolina Department of Commerce and the Economic Development Partnership of North Carolina (EDPNC) were the North Carolina General Assembly, the North Carolina Community College System, Forsyth County, the City of Winston-Salem, and Greater Winston-Salem Inc.", "\r\n\r\nHeadquartered in Johannesburg, South Africa, Radél supplies electrical, electronic, and electro-mechanical components to customers in various industries including railway locomotives, passenger trains, mining equipment, defense and heavy-duty commercial vehicles, and electric vehicles.", "\r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\tFirestone Industrial Products, a leader in air spring technology and mobility solutions, plans to expand manufacturing and distribution operations in Dyersburg, ", ". The $9.1 million project is expected to create 41 jobs.", "\r\n\r\nThe investment will include the construction of a new facility at the company's Firestone Airide site.", "\r\n \r\n“With its strategic location and increased capability, the new distribution center will enable us to shorten time-to-market to meet customer demands while further optimizing our operations. We have a vital role to play in the transformation of mobility created by advanced electric vehicles and supporting technologies, such as our Firestone air springs,” Firestone Airide President Justin Monaghan said.", "\r\n \r\nFirestone Industrial Products, a Bridgestone Americas company, designs and manufactures air springs and related products to eliminate vibration across the automotive, heavy-duty and off-highway segments.", "\r\n\r\n “Bridgestone’s statewide presence is one of the reasons why manufacturing thrives in Tennessee. I thank our partners at Bridgestone and Firestone Airide for their continued investment in Dyersburg and look forward to seeing the regional impact of this project,” ", " Commissioner Stuart C. McWhorter noted.", "\r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\t OMCO Solar, a manufacturer of steel structures for solar panels, plans to establish manufacturing operations in Huntsville, ", ". The more than $10 million project is expected to create 70 jobs in Limestone County.", "\r\n \r\nThe company will lease a facility in the Huntsville West Industrial Park at 7620 Greenbrier Parkway Northwest which will be used to produce solar racking.", "\r\n \r\n“We are thankful to the state of Alabama and their approach to business with tax incentives that line up with our commitment to support domestic manufacturing, create U.S. jobs, and provide factory-direct solutions that solve for the complexity of utility-scale solar projects,” said Gary Schuster, CEO of OMCO Solar. “Our newest facility in Huntsville is our second in the state and shows our dedication to driving growth in Alabama.”", "\r\n\r\nOMCO is a custom roll former, producing highly engineered, custom roll-formed shapes for many applications across a wide range of industries. The company manufactures solar trackers — devices that direct panels towards the sun — and fixed-tilt structures for solar arrays. OMCO now operates six U.S. plants, located in Arizona, Ohio, Indiana, and Alabama. ", "\r\n \r\n “OMCO has a heritage in steel fabrication dating back decades and has built a national manufacturing footprint through savvy investment projects,” noted Ellen McNair, Secretary of ", ". “I’m proud that this great company, dedicated to manufacturing its products in America, has decided to expand its presence in Alabama and create additional career opportunities in Huntsville.”", "\r\n \r\n“The company’s products will serve many applications in our robust manufacturing arena, especially in the ", " providing solar panel frames and supports,” added Chip Cherry, president & CEO of the Huntsville/Madison County Chamber. “OMCO is strategically located to support First Solar Inc., which located in Lawrence County in 2022. This is a win for the U.S., Alabama and the green-energy economy.”", "\r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\t Martco, parent company for timber sourcing and manufacturing company RoyOMartin, plans to upgrade operations in Allen Parish, ", ". The more than $30 million project is expedited to retain 232 jobs.", "\r\n\r\nThe investment will include the installation of technologically advanced production equipment.", "\r\n \r\n“Our Oakdale OSB facility has been a cornerstone of RoyOMartin since it produced the first panel in January 2007,” said Terry Secrest, executive vice president of manufacturing and product sales. “Throughout the years, the facility has consistently been the safest and highest-producing OSB manufacturer in North America. With the high production rates, the press needed replacement to meet the growing market demands. Given the strong workforce, timber availability, proximity to the fastest-growing housing markets, and Louisiana’s improved economic development climate, this $30 million investment secures the Oakdale mill’s status as a world-class manufacturing facility in Allen Parish for many years to come.”", "\r\n\r\nThe project is being supported by an ", " that includes a performance-based Retention and Modernization Tax Credit valued at $455,400.", "\r\n \r\n“RoyOMartin is a third-generation family-owned business doing business in Louisiana for more than 100 years, and I am thrilled to see this company positioning itself to thrive for many more,” Louisiana Economic Development (", ") Secretary Susan B. Bourgeois noted. “Louisiana timber has long supported the national housing industry, and so has our skilled manufacturing workforce, which continues to meet the challenge of modernization with the talent and training companies need to compete.”", "\r\n\r\nMartco L.L.C., known by its trade name RoyOMartin (“ROM”), is one of a group of vertically integrated companies owned by the Martin family focused on land, timber, and mineral resources, with special emphasis on sustainable forests and forest-product manufacturing businesses. ", "\r\n \r\n“RoyOMartin’s modernization project is proof that our region’s wood basket is resilient and strong,” said Jonathan Dean, vice president of economic development for the Southwest Louisiana Economic Development Alliance. “This investment in the company’s Oakdale facility is a testament to the world-class workforce that we have in Allen Parish and in southwest Louisiana. We want to thank RoyOMartin for its investment and its commitment to the region.”", "\r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\t Estes Energetics, a black powder, chemical and rocket motor manufacturing company, plans to expand production operations in Bossier Parish, ", ". The $7.2 million project is expected to create twelve jobs.", "\r\n \r\nThe company will locate in a 30,000-square-foot building at Camp Minden which will manufacture potassium nitrate, barium nitrate, strontium nitrate, strontium oxalate, strontium peroxide, potassium chlorate, potassium perchlorate and potassium sulfate. Operations are scheduled for 2026.", "\r\n \r\n“Estes Energetics is excited to continue growing its role in the U.S. critical chemicals industrial base in partnership with the Department of Defense and state of Louisiana,” said Karl Kulling, CEO of Estes Energetics. “We are expanding our Camp Minden operations, where we recently restarted the only U.S. black powder plant which is well-suited to this type of work.”", "\r\n \r\nThe project is being supported by an incentives package including the comprehensive workforce development solutions of LED FastStart. It also includes a $550,000 Performance-Based Grant for building and infrastructure improvements to state-owned assets. In addition, the company is expected to participate in the state’s Quality Jobs and Industrial Tax Exemption programs.", "\r\n \r\n“Today’s announcement is a great example of the positive impact that Louisiana’s support for our nation’s military and national defense can have on our state’s economy,” Louisiana Economic Development (", ") Secretary Susan B. Bourgeois noted. “Estes Energetics’ second Camp Minden facility will create good-paying jobs for our skilled manufacturing workforce, and provide the U.S. Department of Defense with critical materials they need to keep our country safe.”", "\r\n \r\nGoex Industries, a wholly-owned subsidiary of Estes Energetics, is the only producer of black powder in North America. The company has been a supplier for the Department of Defense since September 2023.", "\r\n \r\n “The Greater Bossier Economic Development Foundation is proud to welcome Estes Energetics to Bossier Parish and Camp Minden,” GBEDF President and Executive Director Rocky Rockett added “Working with LED, it is our firm belief that they will enjoy many years of profitable success in Bossier Parish. This decision once again demonstrates the many offerings that Camp Minden and Bossier Parish can bring to the table to a variety of industries that enhance their bottom line and their productivity.”", "\r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\t BENTELER Steel/Tube Manufacturing Corporation, a specialist in metal processing, plans to expand its operations at the Port of Caddo-Bossier, ", ". The $21 million project is expected to create 49 jobs.", "\r\n\r\nThe investment will include the construction of a new threading facility for hot rolled seamless steel tubes. Construction is scheduled to begin by the end of April.", "\r\n \r\n“I’m excited that we are extending our vertical integration for Oil Country Tubular Good products in Shreveport with this threading facility,” said Kai Christian Zimmermann, Executive Vice President North America BENTELER Steel/Tube. “This will enable us to be even closer to our end-customers and our distributors. It is a reflection of our ongoing commitment to the industry and the region. Together with our partners, we will provide finished casing from the mill directly to the drilling locations. We will be able to reach both the Mid-Continent region and Rockies more competitively.”", "\r\n\r\nThe project is being supported by an incentives package including the comprehensive workforce development solutions of LED FastStart. The company is also expected to participate in the state’s Quality Jobs program.", "\r\n \r\n “Economic development projects like this don’t only benefit the state’s economy through investment and job creation, but also by providing support to key industries in our state,” Louisiana Economic Development (", ") Secretary Susan B. Bourgeois noted. “I thank BENTELER for seeing and utilizing Louisiana’s unique business advantages, like our port system and skilled manufacturing workforce, and reaffirming its commitment to our state and our people.”", "\r\n \r\nBENTELER serves customers in automotive technology, the energy sector and mechanical engineering. The company’s Shreveport facility currently manufactures a wide range of products including drill pipe, tubing, line pipe, structural pipe, couplingstock and casing.", "\r\n\r\n“BENTELER’s continued growth and expansion at the Port of Caddo-Bossier is a sign of a healthy business ecosystem in northwest Louisiana,” North Louisiana Economic Partnership President and CEO Justyn Dixon added. “We’re extremely excited about this announcement and what the future holds for BENTELER and The Port of Caddo-Bossier.”", "\r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\tWashington Penn Plastic Co., a provider of polypropylene and polyethylene compounds, plans to establish manufacturing operations in Winchester, ", ". The approximately $105 million project is expected to create 88 jobs in Clark County.", "\r\n \r\nThe investment will include the construction of a new 250,000-square-foot facility located on 70 acres which will produce polypropylene and polyethylene compounds in pellet form. Completion is scheduled for 2025.", "\r\n \r\n “Washington Penn is excited to continue working with its partners in Kentucky and the Winchester community and to begin operations in Winchester,” said Will Torpey, president of Washington Penn.", "\r\n\r\nThe Kentucky Economic Development Finance Authority preliminarily approved an ", " with the company under the Kentucky Business Investment program. KEDFA also approved the company for additional tax incentives through the Kentucky Enterprise Initiative Act (KEIA). KEIA allows approved companies to recoup Kentucky sales and use tax on construction costs, building fixtures, equipment used in research and development and electronic processing.", "\r\n \r\n\r\nBy meeting its annual targets over the agreement term, the company can be eligible to keep a portion of the new tax revenue it generates. The company may claim eligible incentives against its income tax liability and/or wage assessments. ", "\r\n\r\n“It is an exciting time to be doing business here in the commonwealth, and companies throughout the U.S. and around the world are taking advantage of our state’s business-friendly environment,” noted Governor Andy Beshear. “I am thrilled to be here today celebrating this welcomed next step for Washington Penn, the community of Winchester and the state’s manufacturing sector. I look forward to watching the company’s continued success here in Kentucky.”", "\r\n\r\nIn addition, Washington Penn can receive resources from Kentucky’s workforce service providers. Those include no-cost recruitment and job placement services, reduced-cost customized training and job-training incentives.", "\r\n \r\n“Washington Penn’s growth and new location in Winchester is a perfect combination of planning, collaboration and success,” added John Bevington, senior director of Business and Economic Development. “The planning and development of this site by the Winchester Clark County Industrial Authority; the collaborative investment in site readiness by the KPDI program, the community and KU’s Opportunity Kentucky grant and Washington Penn’s growth and success in Kentucky are a near perfect economic development picture. Congratulations and thanks to all involved.”", "\r\n \r\nWashington Penn Plastic focuses on developing custom solutions to meet the material needs of its customers in the automotive, appliance, construction and consumer markets. The company currently operates over 40 plastic compounding lines in eight facilities across North America, Asia and Europe. ", "\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\tEPL America, LLC, a specialty packaging manufacturer, plans to expand its manufacturing operation in Danville, ", ". The $34.7 million project is expected to create 24 jobs.", "\r\n \r\nThe investment will include building upgrades and new machinery that will allow the company to grow into the beauty and cosmetic markets and serve customers interested in replacing existing plastic products with laminate tubes.", " \r\n                  \r\n  “We at EPL are grateful to Governor Glenn Youngkin and the incentives provided from the state of Virginia,” said Mauro Catopodis, President, EPL Limited Americas Region. “This will strengthen our long-term commitment to the City of Danville and the Commonwealth of Virginia and help us become a bigger economic benefactor in the community. Thank you on behalf of our 315 employees in Danville and 3,700 worldwide.”", "\r\n \r\nThe Governor’s office approved a $90,000 grant from the Commonwealth’s Opportunity Fund to assist the City of Danville with the project. Funding and services to support the company’s employee training activities will be provided through the Virginia Jobs Investment Program. ", "      \r\n\r\n“We are proud to have EPL expand in Virginia and the City of Danville,” noted Secretary of Commerce and Trade Caren Merrick. “The Commonwealth offers the location, infrastructure, and robust workforce that attract companies like EPL, and I congratulate all the partners involved in securing this project that will create new jobs and contribute to a prosperous economy for local citizens.”", "\r\n \r\nThe Virginia Economic Development Partnership (", ") worked with the City of Danville and the Southern Virginia Regional Alliance to secure the project.", "\r\n\r\n“EPL has been an integral part of Danville’s thriving manufacturing sector for over two decades, continually innovating through modernization of technology, processes, and equipment to ensure ongoing success for their workforce in the years ahead,” added Linda Green, Executive Director of the Southern Virginia Regional Alliance. “Their contributions to excellence in packaging keeps them at the forefront of the industry, guaranteeing their continued contributions to both the region and the Commonwealth.”", "\r\n\r\n EPL America, LLC is part of EPL Group, a global leader in specialty packaging. EPL produces plastic laminated tubes for industries such as oral care, beauty and cosmetics, and pharmaceuticals. The company currently operates 21 factories across five continents. ", "\r\n \r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\tKalmbach Feeds, a manufacturer of animal feed, plans to expand operations in Wyandot County, ", ". The $12 million project is expected to create 40 jobs.", "\r\n \r\nThe investment includes a new 100,000-square-foot warehouse in Crawford Township, in close proximity to the company’s existing location in Upper Sandusky. ", "\r\n \r\n“We are blessed to see increased demand for our products from existing and new customers. This warehouse addition gives the space we need to fill customer orders quickly and serve more customers every day,” Paul Kalmbach, Jr., Kalmbach Feeds President said.", "\r\n\r\nBoth ", " and the Regional Growth Partnership (RGP) provided support for the project through the offering of an Economic Development Grant to help defray investment costs. Additionally, the Wyandot County Office of Economic Development (WCOED) worked with the Wyandot County Commissioners and Crawford Township Trustees to facilitate an Enterprise Zone agreement helping to decrease real property tax liability as a result of the development.", "\r\n\r\n“Northwest Ohio has a deep agricultural heritage, along with outstanding infrastructure, talent, logistics and innovative solutions. With the support of JobsOhio, this expansion by Kalmbach Feeds further solidifies Northwest Ohio as a leading location for investment within the food processing and agribusiness industry,” Dean Monske, president and CEO of the Regional Growth Partnership (RGP) noted.", "\r\n\r\n \r\nKalmbach Feeds manufactures and sells animal feed and custom nutritional products for all livestock and poultry species.", "\r\n\r\n“Kalmbach Feeds has been a staunch supporter of so many efforts in Wyandot County. We are blessed to have a high-growth, family-owned, industry leader located in our rural community, and we're happy to assist in its latest local investment.” Greg Moon, WCOED Executive Director added.", "\r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\tCertus Medical, a medical device company delivering high-quality products and services to healthcare professionals and patients, is expanding operations in Ingham County, ", ". The more $200,000 project is expected to create 25 jobs.", "\r\n  \r\nThe project is Beijing supported by a $125,000 Michigan Business Development program performance-based grant.", " \r\n\r\n\"We are immensely grateful for the support and incentives provided by the state of Michigan,” said Zac Gerdts, Principal, Certus Medical. “These resources will be instrumental in accelerating our economic development initiatives, enabling us to expand our operations and create meaningful opportunities for both our company and the community at large.” ", "\r\n\r\nLansing Economic Area Partnership (LEAP) is providing support through job training and talent recruitment valued at approximately $5,000 per employee.  ", "\r\n\r\n \"Congratulations to the city of East Lansing as LEAP has landed an important new medtech company from outside of the region. We are so appreciative to Certus for their confidence in our blossoming medtech and knowledge-based, growing regional economy,” noted Bob Trezise, President and CEO of Lansing Economic Area Partnership. ", "\r\n \r\nCertus Medical specializes in components used in hip, knee, and shoulder replacement surgeries. ", "\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\tTesa Tape, a subsidiary of Germany-based tesa SE, a manufacturer of self-adhesive solutions, established its new headquarters in Grand Rapids, ", ". The $1.2 million project is expected to create 60 jobs.", "\r\n \r\nThe company currently operates manufacturing operations in Sparta.", "\r\n\r\n“By choosing to relocate their primary US corporate function to Grand Rapids, tesa is playing a pivotal role in fostering a more prosperous region for families and individuals in our community,” said Brent Case, Vice President of Business Attraction at The Right Place. “We’re grateful for their continued investment in our region.”", "\r\n\r\nThe project is being supported by The Right Place and Michigan Economic Development Corporation (", ") who offered support by effectively organizing state and local resources.", "\r\n \r\n “Global companies like tesa recognize the exceptional value and amenities that downtown Grand Rapids offers for their professional and corporate services employees,” noted Jono Klooster, Acting Director of Economic Development, City of Grand Rapids. ", "\r\n \r\nTesa Tape serves the appliance, automotive, building supply, electronics, industrial, paper and print, and transportation industries. The company provides more than 7,000 adhesive solutions.", "\r\n \r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\tFUJIFILM Diosynth Biotechnologies North Carolina, Inc., a contract development and manufacturing organization, plans to expand its biopharmaceutical manufacturing operation in Holly Springs, ", ". The $1.2 billion project is expected to create 680 jobs in Wake County.", "\r\n\r\nThe investment will include additional large-scale monoclonal antibody Drug Substance manufacturing capacity that will support the company’s growing biologics CDMO business, two additional drug substance manufacturing buildings, a shared headblock building with administrative space, as well as expansions of utilities, lab, and warehouse buildings currently under construction.", "\r\n \r\n“At FUJIFILM Diosynth Biotechnologies, we are committed to supporting a healthier society by providing state-of-the-art manufacturing expertise and capabilities which enable our partners to bring life-impacting medicines to patients in the United States and worldwide,” said Lars Petersen, president and chief executive officer, FUJIFILM Diosynth Biotechnologies. “On behalf of our company and its employees, we are extremely grateful to Governor Cooper, elected officials, economic and workforce development partners, Wake County, the Town of Holly Springs, the residents of North Carolina, and our ", " partners for embracing FUJIFILM Diosynth Biotechnologies as we expand our manufacturing network in the US and Europe with this North Carolina facility and collectively build a vibrant life sciences ecosystem in the state.”", "\r\n\r\nThe project will be supported, in part, by a Job Development Investment Grant (JDIG) approved by the state’s Economic Investment Committee. Over the course of the 12-year term of this grant, the project is estimated to grow the state’s economy by $4.7 billion. Using a formula that takes into account the new tax revenues generated by the new jobs, the JDIG agreement authorizes the potential reimbursement to the company of up to $14,989,500, spread over 12 years. State payments only occur following performance verification by the departments of Commerce and Revenue that the company has met its incremental job creation and investment targets.", "\r\nThe project’s projected return on investment of public dollars is 298 percent, meaning for every dollar of potential cost to the state, the state receives $3.98 in state revenue. JDIG projects result in positive net tax revenue to the state treasury, even after taking into consideration the grant’s reimbursement payments to a given company.", "\r\n\r\n“North Carolina is known worldwide as a biotechnology hub thanks to the continued investment from companies like FUJIFILM Diosynth,” noted Christopher Chung, CEO of the Economic Development Partnership of North Carolina (", "). “Our robust infrastructure, top-notch engineering talent in the state, and partnerships with entities like NC State University and the North Carolina Biotechnology Center provide support for innovative companies like FUJIFILM to continue to grow.”", "\r\nFUJIFILM Diosynth Biotechnologies’ JDIG agreement could also move as much as $4,996,500 into a fund that helps rural communities across the state attract business in the future. When companies select a site located in a Tier 3 county such as Wake, their JDIG agreements move some of the new tax revenue into the state’s Industrial Development Fund – Utility Account. ", "\r\n“Fujifilm’s investment will provide critical capacity to manufacture innovative therapies. As an integral member of North Carolina’s life sciences community, we are fully committed to supporting their continued success and growth in the state,” added Laura Rowley, Ph.D., Vice President of Life Sciences Economic Development for the North Carolina Biotechnology Center. “While the strength of North Carolina’s biomanufacturing training infrastructure is unparalleled, collaborative efforts including the Accelerate NC: Life Sciences Manufacturing Coalition are underway to increase awareness and ensure NC remains the leading location for biomanufacturing.”", "\r\nPartnering with the North Carolina Department of Commerce and the Economic Development Partnership of North Carolina on this project were the North Carolina General Assembly, the North Carolina Department of Environmental Quality, the North Carolina Department of Transportation, the North Carolina Community College System, Wake Technical Community College, the North Carolina Biotechnology Center, North Carolina State University, the North Carolina Japan Center, Dominion Energy, Duke Energy, the Capital Area Workforce Development Board, the Wake County Board of Commissioners, the Town of Holly Springs, and Wake County Economic Development, a program of the Raleigh Chamber.", "\r\n“Projects like this are truly transformative for our community, with long-term economic benefits,” said Michael Haley, Executive Director of Wake County Economic Development. “FUJIFILM Diosynth Biotechnologies continues to invest in Wake County due to the strong network of partners that make up our ecosystem. This announcement is the result of dedicated work across a variety of organizations to propel our community forward.”", "\r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\tTwo Rivers Lumber Co. LLC plans to establish operations in Coosa County, ", ". The $115 million project is expected to create 130 jobs.", "\r\n \r\n The new sawmill will specialize in the production of Southern Yellow Pine dimensional lumber. Construction is scheduled to begin in June.", "\r\n\r\n“We are happy to be expanding Two Rivers in the state of Alabama and in Coosa County,” said Jay McElroy, co-owner of Two Rivers Lumber. “We spent over a year searching for a site and planning the project, we look forward to starting up the new operation in August 2025. The local and state support has been great throughout this process.”", "\r\n\r\nTo support the project, the Lake Martin Area Industrial Development Authority is donating 110 acres of land, valued at $2.2 million. In addition, AIDT, the state’s primary workforce development agency, is providing services to the company.", "\r\n \r\n “This investment from Two Rivers Lumber will generate a significant number of well-paying jobs while also driving economic growth in the Coosa County area,” noted Ellen McNair, Secretary of the ", ". “For local residents, this means new opportunities and a brighter future for their communities.”", "\r\n\r\nTwo Rivers was established by the McElroy family, owners of McElroy Truck Lines in Cuba, Alabama, and Roy Geiger, the owner of Sumter Timber in Jefferson, Alabama. The company opened its first sawmill in Marengo County in 2017 which currently has an annual capacity of 200 million board feet.", "\r\n\r\n“I appreciate the support that the Coosa County Commission and Alexander City Mayor Woody Baird and his team have shown me throughout this almost 10-month recruiting process,” added Denise Walls, executive director of the Lake Martin Area Economic Development Alliance. “We all felt like this was a project worth fighting for, and we are excited that Two Rivers will make Coosa County their new home. The local impact of this project will be profound and far-reaching.”", "\r\n \r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\t Protomet Corporation, a manufacturing, engineering and technology corporation, plans to establish engineering and manufacturing operations in Rockwood, ", ". The $25 million project is expected to create 250 jobs in Roane County.", "\r\n \r\nThe investment will include the acquisition and retrofit of the former Albahealth building on North Gateway Avenue. ", "\r\n\r\n“In the last three decades, Tennessee’s pro-business climate has helped fuel our company’s growth. Today, we are excited to announce the creation of our fourth engineering and manufacturing facility in East Tennessee as we partner with the great people of Rockwood to build a bigger future together,”  Protomet Corporation President Jeff Bohanan said.", "\r\n\r\nProtomet designs, engineers and manufactures premium, custom components for manufacturers. Industries served include automotive, boating and homeland security. ", "\r\n\r\n“Today’s announcement is exciting for East Tennessee and builds upon the growth this region has experienced this year. Since 2023, the state has landed more than 3,400 jobs in the Greater Knoxville area, and we appreciate Protomet for strengthening that number with 250 new jobs,” ", " Commissioner Stuart C. McWhorter noted. ", "\r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\t Spectrum Advanced Manufacturing Technologies, a driving force in ISO 9000 precision electronics and assemblies manufacturing, plans toe expand its operations in Colorado Springs, ", ". The project is expected to create more than 100 jobs.", "\r\n \r\nThe investment will include two new buildings at the company’s existing campus.", "\r\n\r\n\"This expansion signifies a strategic response to the growing demand for Spectrum AMT's expertise in high-reliability electronics manufacturing and assembly,\" said Jeff Gilbert, Spectrum Chief Operating Officer. \"We are deeply appreciative of our partnership with 5Star Bank and remain firmly committed to not only supporting critical industries like aerospace and defense but also contributing meaningfully to the advancement of technologies that shape the future, from space exploration and scientific discovery to addressing global medical challenges. We are proud to be part of a Colorado ecosystem that fosters innovation and economic growth, and we are excited to continue playing a vital role in Colorado Springs. This community has been instrumental in our beginning and continued success.\"", "\r\n \r\nOcutrx and Spectrum AMT received unanimous approval from the Colorado Economic Development Commission Job Growth Incentive Tax Credits. The approval allocates $1,281,974 over eight years for the creation of up to 101 net new jobs. ", "\r\n \r\n\"Colorado is a leader in advanced manufacturing, and Spectrum AMT will create over 100 new good-paying jobs in this important industry. We are thrilled to see Spectrum AMT expand in Colorado Springs and this new investment will help Colorado remain the best place to live, work and do business,\" noted Governor Jared Polis.", "\r\n\r\nSpectrum AMT is owned by Ocutrx Technologies, Inc. the developer of the AR/XR medical device headsets: OcuLenz (for patients) and the ORLenz (for surgeons).", "\r\n\r\n“Colorado Springs is recognized around the world for our talented workforce, cutting-edge technology, and quality of life, which supports business innovation and growth,” added Johnna Reeder Kleymeyer, president and CEO of Colorado Springs Chamber & EDC. “Spectrum AMT will bring hundreds of well-paying, high-tech manufacturing jobs to our region, boosting our local businesses and the economy, supporting national security missions, and solidifying the Pikes Peak region’s competitive standing as a sought-after place to live, work, and play.”", "\r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\tCorky’s Food Manufacturing plans to expand operations in Memphis, ", ". The $4 million project is expected to create 28 jobs.", "\r\n\r\nThe investment will include a freezer expansion, additional smokers and new automation, and expanded processing and packing rooms.", "\r\n\r\n “We are excited for growth and the incredible opportunities to expand our line of barbecue items across the nation. We're dedicated to delivering our legendary barbecue and top-notch service not only in our restaurants but also to customers everywhere through grocery chains, food service and direct-to-consumer partners,” Jimmy Stovall, owner and CEO, Corky’s BBQ said. “The demand for our authentic Corky’s hickory-smoked barbecue has us fired up to increase our manufacturing operations and meet the ever-growing appetite for our assortment of barbecue. With each new step, we are proud of our Memphis roots and strengthening our ties to the community. Thank you to the Tennessee Department of Economic and Community Development for being instrumental in fueling our journey towards continually expanding to supply customers from around the country with our old-fashioned barbecue.”", "\r\n\r\n Corky’s produces and distributes the retail food products of Corky’s BBQ, a restaurant in Memphis that has eight locations across Tennessee, Arkansas and Mississippi.", "\r\n \r\n“Today marks an exciting milestone for Corky’s as the company announces it will expand its manufacturing operations to accommodate future growth. This expansion not only highlights Corky’s commitment to Tennessee but also reaffirms Tennessee's position as a premier destination for thriving businesses. We're proud to support Corky's growth and look forward to the continued success it will bring to Shelby County and beyond,\" ", " Commissioner Stuart C. McWhorter noted.", "\r\n \r\n\"While Corky's is expanding its manufacturing presence and creating jobs, it's noteworthy that it is achieving this growth organically. Its story underscores the resilience and ingenuity of our local business community, showcasing that with determination and dedication, Memphis-based companies can flourish and drive economic growth independently,”  Dr. Joann Massey, vice president of operations, EDGE added.", "\r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\tToagosei America Inc., a manufacturer of commodity chemicals, polymer and oligomer, adhesive material, and performance chemicals, plans to expand its operations in West Jefferson, ", ". The $105 million project is expected to create 50 jobs.", "\r\n\r\nThe investment will include the construction of a new acrylic polymer manufacturing facility which will support battery markets.", "\r\n\r\n“We are best known for our Instant Krazy Glue brand, to the North American consumer market. We are expanding the market share of industrial super glue under the brand name Aron Alpha Industrial Krazy Glue as well as industrial Hot Melts under Aron Melt and Evergrip brands, solvent adhesives under Aron Mighty brand, and UV curable resin under Aronix and Aron Oxetane brand names,” said company officials. ", "\r\n \r\nTo support the project the Ohio Tax Credit Authority (TCA) approved a 1.333 percent, seven-year Job Creation Tax Credit.", "\r\n\r\nToagosei America Inc. is part of Japan based Toagosei Group, an independent chemical product company known for producing Krazy Glue.", "\r\n\r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\tNorplas Industries Inc., a company that designs and manufactures automotive systems for original equipment manufacturers, plans to establish operations in Rossford, ", ". The project is expected to create 140 jobs.", "\r\n\r\nThe investment will include the lease and build out of a new facility which will produce a battery case/trays.", "\r\n\r\nThe project is being supported by a 1.329%, 8-year Job Creation Tax Credit approved by the Ohio Tax Credit Authority (TCA).", "\r\n \r\nNorplas designs and manufactures automotive systems for original equipment manufacturers.", "\r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\t Gracious Living KY, a manufacturer and distributor of consumer products, plans to expand its operations in Morgantown, ", ". The approximately $9.8 million project is expected to create 50 jobs in Butler County.", "\r\n \r\nThe investment will allow the company to manufacture patio furniture, storage containers and shelving at its headquarters on 70 Industrial Drive. The expansion is scheduled for completion by the end of 2025.", "\r\n \r\n“We eagerly anticipate the opportunity to expand in a state with hard-working citizens and a supportive government stance on economic growth,” said Charles Kida, vice president of finance at Gracious Living. “The Morgantown site offers an ideal location due to its strategic position for distribution. Gracious Living looks forward to establishing its first presence in the United States through this expansion initiative. This move represents a significant step in the company’s growth strategy.”", "\r\n \r\nTo encourage investment and job growth in the community, the Kentucky Economic Development Finance Authority preliminarily approved a 15-year incentive agreement with the company under the Kentucky Business Investment program. The performance-based agreement can provide up to $1.43 million in ", " based on the company’s investment of $9.78 million and annual targets of creation and maintenance of 50 Kentucky-resident, full-time jobs across 15 years, and paying an average hourly wage of $26.37 including benefits across those jobs.", "\r\n\r\nAdditionally, KEDFA approved Gracious Living KY for up to $70,000 in tax incentives through the Kentucky Enterprise Initiative Act (KEIA). KEIA allows approved companies to recoup Kentucky sales and use tax on construction costs, building fixtures, equipment used in research and development and electronic processing.", "\r\n\r\n “The momentum we are experiencing across the commonwealth is not possible without growth from our largest industry,” noted Governor Andy Beshear. “Manufacturing has long been essential to Kentucky’s economy, and with continued investment from companies like Gracious Living KY, we are setting up the state for long-term success. I want to thank the leaders at Gracious Living for their continued commitment to the commonwealth, and I look forward to seeing the company’s success in Morgantown.”", "\r\n \r\nBy meeting its annual targets over the agreement term, the company can be eligible to keep a portion of the new tax revenue it generates. The company may claim eligible incentives against its income tax liability and/or wage assessments.", "\r\n\r\nIn addition, Gracious Living KY can receive resources from Kentucky’s workforce service providers.", "\r\n\r\n“Gracious Living’s investment is a significant boost to our local economy and reinforces our region’s reputation as a leading destination for manufacturing,” added Ron Bunch, CEO of the Bowling Green Area Chamber of Commerce. “The creation of 50 new jobs is a major win for Morgantown, promising a brighter future for many residents.”", "\r\n \r\nGracious Living is a manufacturer and distributor of consumer products known for items including patio furniture, storage containers, laundry baskets, shelving and recreational products.", "\r\n\r\n\r\n"]},
{"text": ["\r\n\t\r\n\t", "\r\n\r\n\t Food processor and distributor Vienna Beef Ltd. plans to establish pickle production and cold storage operations in Newcomerstown, ", ". The $18.5 million project is expected to create 51 jobs.", "\r\n\r\nThe investment will include the acquisition and retrofitting of an existing 100,000-square-foot facility located at 500 Enterprise Drive.", "\r\n\r\n“The opportunity to add to capacity and locations will allow Vienna Beef to grow the Chipico brand,” said Jack Bodman, President & CEO of Vienna Beef. “This Newcomerstown location is a positive addition to the effort, and we welcome the opportunity to work with the local community, farmers, and government to benefit the local economy over the long term.”", "\r\n \r\nTo support the project the Ohio Tax Credit Authority approved a 1.245 percent, seven-year Job Creation Tax Credit.", "\r\n \r\n “This is a great opportunity for Tuscarawas County, with 51 new jobs and an associated annual payroll of more than $2.7 million,” noted Team NEO Chief Executive Officer Bill Koehler. Along with our local partners, ODOD and JobsOhio, we are sure Vienna Beef will continue to prosper in the Northeast Ohio Region.”  ", "\r\n\r\nVienna Beef Inc. is the main manufacturer of the hot dog used in the classic Chicago-style hot dog, as well as Polish sausage and Italian beef, delicacies of independent Chicago-style hot dog and beef stands. The company also produces a variety of deli meats, some of which are available at Chicago area supermarkets.", "\r\n\r\n “Tuscarawas County Economic Development Corporation is proud to welcome Vienna Beef to Newcomerstown,” added Marla Akridge, Executive Director for Tuscarawas County Economic Development Corporation. “This company is a perfect fit for our rural community, and purchasing a vacant building is better yet. The opportunity will serve as a huge boost to the area, bringing long-term employment and short-term work for local contractors tasked with preparing the facility for occupancy. We look forward to eating a lot of pickles.”", "\r\n\r\n\r\n"]}
]