[
{"heading": ["Denmark-Based Topsoe Plans Chesterfield County, Virginia, Operations", "Kikkoman Foods Plans Jefferson, Wisconsin, Operations", "BWX Technologies Expands Cambridge, Ontario, Nuclear Production Operations", "Greenheck Group Plans Knoxville, Tennessee, Operations", "Local Bounti Plans Pasco, Washington, Indoor Agricultural Operations", "Innovative Construction Group Plans Siler City, North Carolina, Production Operations", "Crystal Window and Door Systems Plans Mansfield, Texas, Headquarters-Production Operations", "JDSAT Expands Fairfax County, Virginia, Operations", "Trussworks Mid-America Plans Jackson, Missouri, Manufacturing Operations", "Epic Flight Academy Establishes Hebron, Kentucky, Operations", "EPC-Columbia Expands Lebanon, Kentucky, Plastic Injection Molding Operations", "Daisy Brand Plans Boone, Iowa, Production Operations", "Canfor Expands Fulton, Alabama, Production Operations", "Tucker Door & Trim Plans Henrico County, Virginia, Operations", "Zekelman Industries Expands Blytheville, Arkansas, Operations", "Fibrebond Corporation Expands Webster Parish, Louisiana, Operations", "Master Steel Expands Hardeeville, South Carolina, Operations", "L3Harris Technologies Expands Orange County, Virginia, Operations", "Republic Airways Holdings Plans Tuskegee, Alabama, Training Operations", "South Africa-Based Radel Plans Winston-Salem, North Carolina, Operations", "Firestone Industrial Products Expands Dyersburg, Tennessee, Operations ", "Samsung Electronics Expands Taylor, Texas, Chip-Manufacturing Operations", "OMCO Solar Plans Huntsville, Alabama, Production Operations", "Martco-RoyOMartin Upgrades Allen Parish, Louisiana, Operations", "Estes Energetics Expands Bossier Parish, Louisiana, Production Operations", "BENTELER Steel/Tube Manufacturing Expands Port of Caddo-Bossier, Louisiana, Operations", "Washington Penn Plastic Establishes Winchester, Kentucky, Production Operations", "EPL America Expands Danville, Virginia, Production Operations", "Certus Medical Expands Ingham County, Michigan, Operations", "Kalmbach Feeds Expands Wyandot County, Ohio, Operations", "Germany-Based Tesa Tape Relocates-Establishes Grand Rapids, Michigan, Headquarters", "FUJIFILM Diosynth Biotechnologies Expands Holly Springs, North Carolina, Operations", "Two Rivers Lumber Plans Coosa County, Alabama, Sawmill Operations", "Protomet Corporation Plans Rockwood, Tennessee, Operations", "Corky’s Food Manufacturing Expands Memphis, Tennessee, Operations", "Spectrum Advanced Manufacturing Technologies Expands Colorado Springs, Colorado, Operations", " Norplas Industries Establishes Rossford, Ohio, Production Operations", "Japan-Based Toagosei America Expands West Jefferson, Ohio, Operations  ", "Gracious Living KY Expands Morgantown, Kentucky, Operations", "Vienna Beef Plans Newcomerstown, Ohio, Operations", "Most Read", "Exclusive Research"], "text": ["\r\n            Denmark-based Topsoe, a manufacturer of solid oxide electrolyzer cells, a crucial component for producing clean hydrogen, plans to establish operations in Chesterfield County, Virginia. The more than $400 million project is expected to create approximately 150 jobs.\r\n          ", "\r\n            Soy sauce manufacturer Kikkoman Foods Inc. plans to expand its brewing plant in Walworth and establish operations in Jefferson, Wisconsin. The $800 million project is expected to create 83 jobs over twelve years.\r\n          ", "\r\n            BWX Technologies, Inc. plans to expand its nuclear manufacturing operation in Cambridge, Ontario. The $80 million project is expected to create 250 jobs.\r\n          ", "\r\n            Greenheck Group, a supplier of air movement, air control and air conditioning equipment, plans to establish operations in Knoxville, Tennessee. The $300 million project is expected to create 440 jobs in Knox County.\r\n\r\n          ", "\r\n            Local Bounti Corporation, an indoor agriculture company, plans to establish operations in Pasco, Washington. The project is expected to create 40 jobs.\r\n          ", "\r\n            Innovative Construction Group, LLC, an off-site construction services company serving developers, general contractors, and professional builders, plans to establish manufacturing operations in Siler City, North Carolina. The $39.8 million project is expected to create approximately 157 jobs in Chatham County over the next five years.\r\n          ", "\r\n            Crystal Window and Door Systems, a manufacturer of quality, energy-efficient vinyl and aluminum windows and high-end fenestration systems, plans to establish operations in Mansfield, Texas. The more than $121 million project is expected to create 504 jobs.\r\n\r\n          ", "\r\n            JDSAT, Inc., an application development and data sciences firm, plans to expand its operations in Fairfax County, Virginia. The $630,000 project is expected to create 60 jobs.\r\n          ", "\r\n            Truss manufacturer Trussworks Mid-America plans to establish production operations in Jackson, Missouri. The $5 million project is expected to create 70 jobs.\r\n          ", "\r\n            Epic Flight Academy established its new FAA Part 147 aircraft mechanic school at Cincinnati/Northern Kentucky International Airport (CVG) in Hebron, Kentucky.\r\n.\r\n          ", "\r\n            EPC-Columbia Inc., a plastic injection molding company, plans to expand operations in Lebanon, Kentucky. The $3.6 million project is expected to create 21 jobs in Marion County.\r\n          ", "\r\n            Daisy Brand, a manufacturer and largest brand of sour cream and cottage cheese in the U.S., plans to establish operations in Boone, Iowa. The $626.5 million project is expected to create 106 jobs.\r\n          ", "\r\n            Integrated forest products company Canfor Corp. plans to expand production operations in Fulton, Alabama. The $19.3 million project is expected to create 64 jobs in Clarke County.\r\n          ", "\r\n            Tucker Door & Trim, a distributor and manufacturer of doors, windows, and specialty millwork to the construction industry, plans to establish manufacturing and assembly operations in Henrico County, Virginia. The $10 million project is expected to create 50 jobs.\r\n          ", "\r\n            Zekelman Industries, an independent steel pipe and tube manufacturer, plans to expand operations in Blytheville, Arkansas.\r\n\r\n          ", "\r\n            Industrial manufacturer Fibrebond Corporation plans to expand operations in Webster Parish, Louisiana. The $50 million project is expected to retain 450 jobs.\r\n          ", "\r\n            Master Steel, a structural steel fabrication company, plans to expand its operations in Hardeeville, South Carolina. The $10 million project is expected to create 14 jobs.\r\n\r\n          ", "\r\n            L3Harris Technologies, an American technology company, defense contractor, and information technology services provider, plans to expand manufacturing operations in Orange County, Virginia. The $41.2 million project is expected to create 80 jobs over the next three years.\r\n\r\n          ", "\r\n            Republic Airways Holdings and its Leadership in Flight Training (LIFT) Academy plan to establish operations in Tuskegee, Alabama. The $27 million project is expected to create 35 jobs over the next three years.\r\n          ", "\r\n            South Africa-Based Radél, Inc., a manufacturer of electro-mechanical components, plans to establish operations in Winston-Salem, North Carolina. The $9 million project is expected to create 50 jobs in Forsyth County by 2029.\r\n          ", "\r\n            Firestone Industrial Products, a leader in air spring technology and mobility solutions, plans to expand manufacturing and distribution operations in Dyersburg, Tennessee. The $9.1 million project is expected to create 41 jobs.\r\n\r\n          ", "\r\n            Samsung Electronics, Co., Ltd., a leader in the global semiconductor industry, plans to expand its operation in Taylor, Texas. The more than $40 billion project is expected to create approximately 4,500 jobs over the coming years.\r\n          ", "\r\n            OMCO Solar, a manufacturer of steel structures for solar panels, plans to establish manufacturing operations in Huntsville, Alabama. The more than $10 million project is expected to create 70 jobs in Limestone County.\r\n\r\n          ", "\r\n            Martco, parent company for timber sourcing and manufacturing company RoyOMartin, plans to upgrade operations in Allen Parish, Louisiana. The more than $30 million project is expedited to retain 232 jobs.\r\n          ", "\r\n            Estes Energetics, a black powder, chemical and rocket motor manufacturing company, plans to expand production operations in Bossier Parish, Louisiana. The $7.2 million project is expected to create twelve jobs.\r\n\r\n          ", "\r\n            BENTELER Steel/Tube Manufacturing Corporation, a specialist in metal processing, plans to expand its operations at the Port of Caddo-Bossier, Louisiana. The $21 million project is expected to create 49 jobs.\r\n          ", "\r\n            Washington Penn Plastic Co., a provider of polypropylene and polyethylene compounds, plans to establish manufacturing operations in Winchester, Kentucky. The approximately $105 million project is expected to create 88 jobs in Clark County.\r\n          ", "\r\n            EPL America, LLC, a specialty packaging manufacturer, plans to expand its manufacturing operation in Danville, Virginia. The $34.7 million project is expected to create 24 jobs.\r\n          ", "\r\n            Certus Medical, a medical device company delivering high-quality products and services to healthcare professionals and patients, is expanding operations in Ingham County, Michigan. The more $200,000 project is expected to create 25 jobs.\r\n          ", "\r\n            Kalmbach Feeds, a manufacturer of animal feed, plans to expand operations in Wyandot County, Ohio. The $12 million project is expected to create 40 jobs.\r\n\r\n          ", "\r\n            Tesa Tape, a subsidiary of Germany-based tesa SE, a manufacturer of self-adhesive solutions, established its new headquarters in Grand Rapids, Michigan. The $1.2 million project is expected to create 60 jobs.\r\n          ", "\r\n            FUJIFILM Diosynth Biotechnologies North Carolina, Inc., a contract development and manufacturing organization, plans to expand its biopharmaceutical manufacturing operation in Holly Springs, North Carolina. The $1.2 billion project is expected to create 680 jobs in Wake County.\r\n\r\n          ", "\r\n            Two Rivers Lumber Co. LLC plans to establish operations in Coosa County, Alabama. The $115 million project is expected to create 130 jobs.\r\n          ", "\r\n            Protomet Corporation, a manufacturing, engineering and technology corporation, plans to establish engineering and manufacturing operations in Rockwood, Tennessee. The $25 million project is expected to create 250 jobs in Roane County.\r\n          ", "\r\n            Corky’s Food Manufacturing plans to expand operations in Memphis, Tennessee. The $4 million project is expected to create 28 jobs.\r\n\r\n          ", "\r\n            Spectrum Advanced Manufacturing Technologies, a driving force in ISO 9000 precision electronics and assemblies manufacturing, plans toe expand its operations in Colorado Springs, Colorado. The project is expected to create more than 100 jobs.\r\n\r\n          ", "\r\n            Norplas Industries Inc., a company that designs and manufactures automotive systems for original equipment manufacturers, plans to establish operations in Rossford, Ohio. The project is expected to create 140 jobs.\r\n          ", "\r\n            Toagosei America Inc., a manufacturer of commodity chemicals, polymer and oligomer, adhesive material, and performance chemicals, plans to expand its operations in West Jefferson, Ohio. The $105 million project is expected to create 50 jobs.\r\n\r\n          ", "\r\n            Gracious Living KY, a manufacturer and distributor of consumer products, plans to expand its operations in Morgantown, Kentucky. The approximately $9.8 million project is expected to create 50 jobs in Butler County.\r\n\r\n          ", "\r\n            Food processor and distributor Vienna Beef Ltd. plans to establish pickle production and cold storage operations in Newcomerstown, Ohio. The $18.5 million project is expected to create 51 jobs.\r\n          "]}
]